src/test/resources/send_sms.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soap.service.eio/">
  <soapenv:Header/>
  <soapenv:Body>
    <soap:send>
      <message>
        <template>DOI</template>
        <channel>sms</channel>
        <recipient>
          <address>test@localhost</address>
          <!--Optional:-->
          <name>Unknown</name>
        </recipient>
        <model>
          <!--Zero or more repetitions:-->
          <entry>
            <key>firstname</key>
            <value>John</value>
          </entry>
          <entry>
            <key>lastname</key>
            <value>Doe</value>
          </entry>
          <entry>
            <key>code</key>
            <value>1234567890</value>
          </entry>
          <entry>
            <key>includeDisclaimer</key>
            <value>false</value>
          </entry>
        </model>
        <!--Zero or more repetitions:-->
        <!--
        <attachments>
          <filename>?</filename>
          <contentType>?</contentType>
          <payload>?</payload>
        </attachments>
        -->
      </message>
    </soap:send>
  </soapenv:Body>
</soapenv:Envelope>